[
    {
        "url": "https://en.wikipedia.org/wiki/Pakistan",
        "title": "Pakistan",
        "first_paragraph": "Pakistan,officially theIslamic Republic of Pakistan,is a country inSouth Asia. It is thefifth-most populous country, with a population of over 241.5 million,having thesecond-largest Muslim populationas of 2023.Islamabadis the nation's capital, whileKarachiisits largest cityandfinancial centre. Pakistan is the33rd-largest country by area. Bounded by theArabian Seaon the south, theGulf of Omanon the southwest, and theSir Creekon the southeast, it shares land borders withIndiato the east;Afghanistanto the west;Iranto the southwest; andChinato the northeast. It shares a maritime border withOmanin the Gulf of Oman, and is separated fromTajikistanin the northwest by Afghanistan's narrowWakhan Corridor.",
        "references": [
            "^Article 251 of theConstitution of Pakistan",
            "^\"Includes data for Pakistani territories of Kashmir;Azad Kashmir(13,297 km2or 5,134 sq mi) andGilgit–Baltistan(72,520 km2or 28,000 sq mi).Excluding these territories would produce an area figure of 796,095 km2(307,374 sq mi).\"",
            "^ab\"This figure does not include data for Pakistan-administered areas of Kashmir; Azad Kashmir and Gilgit-Baltistan, which, according to 2017 Pakistani census, had a population of 4,045,367 and 1,492,924 respectively.\"",
            "^SeeDate and time notation in Pakistan.",
            "^Urdu:پَاکِسْتَان,Urdu pronunciation:ⓘ; Pronounced variably in English as/ˈpækɪstæn/ⓘ,/ˈpɑːkɪstɑːn/ⓘ,/ˌpækɪˈstæn/, and/ˌpɑːkɪˈstɑːn/.",
            "^ISO:اِسْلامی جُمْہُورِیَہ پَاکِسْتَان,Islāmi Jumhūriyāh Pākistān",
            "^The precise time span of the period is uncertain.Philologicalandlinguisticevidence indicates that theRigveda, the oldest of the Vedas, was composed roughly between 1700 and 1100 BCE, also referred to as the early Vedic period. Oberlies gives an estimate of 1200–1100 BCE for the youngest hymns in book ten. Estimates for aterminus post quemof the earliest hymns are more uncertain. Other 'cumulative evidence' sets a wide range of 1700–1100.",
            "^The World Bank data lists the total area of Pakistan as 770,880 km², excluding Gilgit-Baltistan, Azad Kashmir, and water areas.",
            "^In the framework of their regional security complex theory (RSCT), Barry Buzan and Ole Waever differentiate between superpowers and great powers which act and influence the global level (or system level) and regional powers whose influence may be large in their regions but have less effect at the global level. This category of regional powers includes Brazil, Egypt, India, Iran, Iraq, Israel, Nigeria, Pakistan, Saudi Arabia, South Africa and Turkey.",
            "^This number includes population of the Hindu (Jati) and the scheduled castes."
        ],
        "reference_count": 10
    },
    {
        "url": "https://en.wikipedia.org/wiki/Vira_(dance)",
        "title": "Vira (dance)",
        "first_paragraph": "Thevirais a traditional dance fromPortugal.It is most popular in theMinhoregion but is performed in every region.It has a three-step rhythm which is very similar to awaltz, but it is faster, and the couples dance front-to-front without holding hands.",
        "references": [
            "^Danceanddance: Vira",
            "^\"I Support Lagos, Algarve, Portugal - Portuguese Dance\".www.empowerment-gateway.com. Archived fromthe originalon 12 March 2012. Retrieved14 January2022.",
            "^",
            "^Schwann record & tape guide - 1966 Page 161 Bartholomew: Shenandoah (Heath. Yale University Glee Club); Kenins: Bon homme (Barnes, University of Toronto Chorus); Portuguese Folk Dance: Vira (Raposo Marques, Orfeón Académico de Coimbra)"
        ],
        "reference_count": 4
    }
]